{"id": "1960rmi", "thumbnail": "https://b.thumbs.redditmedia.com/jo40mtfzJbTvBeSzdkSu0rallqyJ57z10q_8vNPy3Fk.jpg", "selftext": "", "title": "elon then. elon now.", "permalink": "/r/WhitePeopleTwitter/comments/1960rmi/elon_then_elon_now/", "scores": {"Negativo": 0.07439669966697693, "Neutro": 0.8472803235054016, "Positivo": 0.07832297682762146}}
{"id": "1d2fvyr", "thumbnail": "https://b.thumbs.redditmedia.com/VOnLjrh7H34XlFNZnnqy8DNJayr63rRO3JCfT74mCAw.jpg", "selftext": "", "title": "Yann LeCun Elon Musk exchange.", "permalink": "/r/singularity/comments/1d2fvyr/yann_lecun_elon_musk_exchange/", "scores": {"Negativo": 0.05547209456562996, "Neutro": 0.8957149386405945, "Positivo": 0.04881293326616287}}
{"id": "1ckaztu", "thumbnail": "https://b.thumbs.redditmedia.com/h4LfEzKp0c3HpvdtgV63dQnck60mbhtu_TfV35F_JfY.jpg", "selftext": "", "title": "What does it say when even Elon is sick of you, and its fucking Elon?", "permalink": "/r/WhitePeopleTwitter/comments/1ckaztu/what_does_it_say_when_even_elon_is_sick_of_you/", "scores": {"Negativo": 0.923851728439331, "Neutro": 0.06754636019468307, "Positivo": 0.008601920679211617}}
{"id": "1cc4nn8", "thumbnail": "https://b.thumbs.redditmedia.com/yMOQ0l_022JqYNdbnXjI0ie1ndtG1Qblc7sZO5I_SQE.jpg", "selftext": "", "title": "Elon out and about.", "permalink": "/r/WhitePeopleTwitter/comments/1cc4nn8/elon_out_and_about/", "scores": {"Negativo": 0.03717530891299248, "Neutro": 0.8948088884353638, "Positivo": 0.06801574677228928}}
{"id": "17fsskh", "thumbnail": "https://b.thumbs.redditmedia.com/jv9mPXlc72U38mMZsW6f4m6jEwuzALtk7-2IqS0ijoc.jpg", "selftext": "", "title": "Elon vs. Wikipedia", "permalink": "/r/clevercomebacks/comments/17fsskh/elon_vs_wikipedia/", "scores": {"Negativo": 0.10514650493860245, "Neutro": 0.8459399342536926, "Positivo": 0.048913560807704926}}
{"id": "193asyz", "thumbnail": "https://a.thumbs.redditmedia.com/Fjf3s7m9kozXNJvtsH8Lt_gCcVjvFA3oFw1PwR7ZeB4.jpg", "selftext": "", "title": "Elon Musk is the damn CEO of racism at this point", "permalink": "/r/facepalm/comments/193asyz/elon_musk_is_the_damn_ceo_of_racism_at_this_point/", "scores": {"Negativo": 0.9300758242607117, "Neutro": 0.06418811529874802, "Positivo": 0.005736063700169325}}
{"id": "1bute49", "thumbnail": "self", "selftext": "", "title": "People who liked Elon Musk but no longer do, what was the turning point? ", "permalink": "/r/AskReddit/comments/1bute49/people_who_liked_elon_musk_but_no_longer_do_what/", "scores": {"Negativo": 0.5121765732765198, "Neutro": 0.4545918107032776, "Positivo": 0.0332316979765892}}
{"id": "1ala007", "thumbnail": "https://a.thumbs.redditmedia.com/pO1tlJg3nZqIoQkbwn-MmnxZ8hdqade5JpkOYGZ4KO4.jpg", "selftext": "Its frustrating that people cant even understand that deaf and h.o.h. are very diverse and that ASL aint global nor is English writing.\n\nJust cause a deaf person knows English it doesn't mean we know ASL and those who know ASL aint necessarily English language users.", "title": "Elon Musk beeing a idiot as usual..", "permalink": "/r/deaf/comments/1ala007/elon_musk_beeing_a_idiot_as_usual/", "scores": {"Negativo": 0.883384644985199, "Neutro": 0.10295235365629196, "Positivo": 0.013663038611412048}}
{"id": "1d2qd35", "thumbnail": "https://b.thumbs.redditmedia.com/ZczLa7nVO7KYNI63Zbjk8u1qvdOt01lTSurSlZaQBSI.jpg", "selftext": "", "title": "So we can all agree that Elon musk is a fraud?", "permalink": "/r/learnmachinelearning/comments/1d2qd35/so_we_can_all_agree_that_elon_musk_is_a_fraud/", "scores": {"Negativo": 0.7227612137794495, "Neutro": 0.2656558156013489, "Positivo": 0.011583003215491772}}
{"id": "1cwjxvt", "thumbnail": "https://b.thumbs.redditmedia.com/aFIJYqoxPPBd3HpVpb7Q9_Ll8yH8WhQ-TljdWFJjOWc.jpg", "selftext": "", "title": "Elon Musk confirms his threat: give me 25% of Tesla or you don't get AI and robotics", "permalink": "/r/teslamotors/comments/1cwjxvt/elon_musk_confirms_his_threat_give_me_25_of_tesla/", "scores": {"Negativo": 0.4325404465198517, "Neutro": 0.4717349112033844, "Positivo": 0.09572463482618332}}
{"id": "gv32al", "thumbnail": "self", "selftext": "All three idols have spoken up for the black lives matter movement. Amber and BM’s fans acknowledged their idols non-silence, why can’t some NCTzens do the same and go back to focusing on the movement instead of tripping over the fact that he did not publicly donate? \n\nStop centering the narrative around things that don’t matter right now. Focus on the MOVEMENT. Be angry about the right things.", "title": "Johnny Suh (NCT), Amber Liu (fx), BM (Kard) all posted for Blackout Tuesday, yet the comments they receive are radically different", "permalink": "/r/kpopthoughts/comments/gv32al/johnny_suh_nct_amber_liu_fx_bm_kard_all_posted/", "scores": {"Negativo": 0.21143433451652527, "Neutro": 0.7098264694213867, "Positivo": 0.07873914390802383}}
{"id": "c0gp2x", "thumbnail": "self", "selftext": "Thought maybe some of you fans might find this interesting. \n\nI just started getting in to kpop and decided to watch a playlist on YouTube today to try to explore beyond BTS and Blackpink for once. Came upon a NCT 127 video and thought, “Whoa, that guy looks just like John Suh” and just LOST IT to find out IT WAS!! \n\nReached out to basically everyone I’m still in contact with from high school to see if they knew about this and THEY DIDN’T! Even one who was way closer with him and has been listening to kpop since middle school. He said he knew he was trying to make it every since we graduated, but had thought he had quit by now. \n\nCrazy right?! I’m guessing this group is pretty big based on their YouTube views, yet none of us back here in Northbrook seem to know we’re the hometown of a famous kpop idol.", "title": "I grew up with Johnny from NCT 127 and just found out today that he’s famous- his hometown doesn’t seem to know!", "permalink": "/r/kpop/comments/c0gp2x/i_grew_up_with_johnny_from_nct_127_and_just_found/", "scores": {"Negativo": 0.019509928300976753, "Neutro": 0.3915606141090393, "Positivo": 0.5889294743537903}}
{"id": "1cryoln", "thumbnail": "https://b.thumbs.redditmedia.com/KJo4xmUUeNS24u97r6W37dKMEqISiUUPMpyJCP6K48w.jpg", "selftext": "", "title": "Suh! I say, suh! The hour is upon us, suh!", "permalink": "/r/TheSimpsons/comments/1cryoln/suh_i_say_suh_the_hour_is_upon_us_suh/", "scores": {"Negativo": 0.01824248768389225, "Neutro": 0.5658942461013794, "Positivo": 0.4158632457256317}}
{"id": "87d807", "thumbnail": "default", "selftext": "", "title": "Former Dolphins’ DT Ndamukong Suh reached agreement with Los Angeles Rams on a one-year, $14 million deal, per source. Suh took less to go to LA. Suh and Aaron Donald now manning LA’s front.", "permalink": "/r/nfl/comments/87d807/former_dolphins_dt_ndamukong_suh_reached/", "scores": {"Negativo": 0.029496053233742714, "Neutro": 0.9154518842697144, "Positivo": 0.05505205690860748}}
{"id": "geyhi4", "thumbnail": "https://a.thumbs.redditmedia.com/q-_GQs5cTnRQNM292XOBj-02uHUqkiWqWSukvr_yNj8.jpg", "selftext": "", "title": "Luh-Who-Suh-Her", "permalink": "/r/KidsAreFuckingStupid/comments/geyhi4/luhwhosuhher/", "scores": {"Negativo": 0.28327101469039917, "Neutro": 0.681387186050415, "Positivo": 0.035341810435056686}}
{"id": "dxlva4", "thumbnail": "https://b.thumbs.redditmedia.com/SIH7UXxmo72o-ATpauQRntJh1naodvgAky_fJB7RN2s.jpg", "selftext": "", "title": "Kit, Suh and Ney. The Fox Mothers.", "permalink": "/r/Bossfight/comments/dxlva4/kit_suh_and_ney_the_fox_mothers/", "scores": {"Negativo": 0.0356595553457737, "Neutro": 0.9118382930755615, "Positivo": 0.0525021031498909}}
{"id": "tvc10z", "thumbnail": "default", "selftext": "", "title": "[Highlight] Suh steps on Rodgers' bad ankle .. twice (2014)", "permalink": "/r/nfl/comments/tvc10z/highlight_suh_steps_on_rodgers_bad_ankle_twice/", "scores": {"Negativo": 0.06315837055444717, "Neutro": 0.8581258058547974, "Positivo": 0.0787157416343689}}
{"id": "2yclxr", "thumbnail": "default", "selftext": "", "title": "Suh will sign with Dolphins Tuesday", "permalink": "/r/nfl/comments/2yclxr/suh_will_sign_with_dolphins_tuesday/", "scores": {"Negativo": 0.009067614562809467, "Neutro": 0.9406271576881409, "Positivo": 0.05030516907572746}}
{"id": "83rnwf", "thumbnail": "https://b.thumbs.redditmedia.com/7HYz50q1rht7UQ_x7DcwSjdzoQUwQ8sMNpEn6pFPCzA.jpg", "selftext": "", "title": "Karma by Do-Ho Suh, sculpture, 2012", "permalink": "/r/Art/comments/83rnwf/karma_by_doho_suh_sculpture_2012/", "scores": {"Negativo": 0.024689162150025368, "Neutro": 0.9325964450836182, "Positivo": 0.042714428156614304}}
{"id": "scpgmw", "thumbnail": "default", "selftext": "", "title": "Matthew Stafford doesn't know why former Detroit Lions teammate Ndamukong Suh hates him", "permalink": "/r/nfl/comments/scpgmw/matthew_stafford_doesnt_know_why_former_detroit/", "scores": {"Negativo": 0.7453539371490479, "Neutro": 0.2473694086074829, "Positivo": 0.007276732940226793}}
{"id": "14m81hi", "thumbnail": "self", "selftext": "When I was little I would think to myself. I am chameleon. I would act certain ways around certain people and had this thought for most of my young life. Learning about ASD in women a common symptom is masking. I haven’t got the pleasure of being diagnosed with autism but the more I read and the more videos I watch with people that have it, idk how it wasn’t obvious to my doctors. I am really good at masking though so maybe it is that. I cannot wait to find a doctor that is able to get my diagnosed and put me on the right track. \n\nMy question is, anyone that has both in this group have similar “chameleon” feelings growing up? Was it apparent to you but very few other people that you didn’t have the same thought process as a lot of people? Are people on the spectrum self aware for all their symptoms? Thanks for reading and any feedback would be awesome from people with adhd or on the spectrum.", "title": "ADHD and ASD “masking”", "permalink": "/r/ADHD/comments/14m81hi/adhd_and_asd_masking/", "scores": {"Negativo": 0.4256789982318878, "Neutro": 0.53660649061203, "Positivo": 0.03771453723311424}}
{"id": "165gw3y", "thumbnail": "self", "selftext": "I'm single dad to an ADHD+ASD child, and I have seen many here living this same life. \n\nI am extremely dedicated and loving of my child, but having him on my own is unfeasibly demanding leading to exhaustion and therefore guilt/feeling like I'm not enough as I am genuinely burned out by 9am (he gets up at 5:30am and is 100mph from the off) and just can't keep him happy. \n\nHe won't do anything alone except build lego (has to be brand new sets with instructions to follow, will not free-build), so this is a once-in-a-while treat when I can buy a new set for him, and he is so fast it really isn't a cost effective way to occupy him.\n\nThe rest of the time is him refusing to leave the house so we are stuck home. He won't play games as he can't handle losing. He won't be creative as he can't bear what he makes not being a masterpiece (he is 5), he won't do anything involving imagination such as acting out a funny story with toys, he won't do anything except watching YouTube (any other TV source is 'boring'), or play beat saber in VR (which he is obsessed with, but I limit). \n\nHe likes cooking with me and being shown how to make foods, but he won't eat anything we make together no matter how excited he is at the prospect of making something new and fun, and only ever eats cheese sandwiches or a very specific supermarket pizza, literally every day he eats only this. This kinda spoils the experience of cooking, I can't be making things just for us to throw away uneaten.\n\nHe will sometimes suddenly get interested in some old toy or gizmo he hasn't looked at for a while and I will try to stretch out the interest as much as I humanly can, \"look what it does if we do this with it\", etc., but that lasts 5 mins until he's bored. \n\nHe won't put the TV remote down, yet drops it or flings it at the wall at least 20 times a day as he's always bouncing off the walls and furniture. \n\nI just don't know what I'm meant to do... Let him watch YouTube all day? Nothing else fills time except that. I can't do a single thing as he wants me to spin him around or bounce him, he wants to be sat on my shoulders 24/7, which is cute but I can't do it all day. \n\nHow on earth is it possible to entertain a child like this? Does anyone have the answers? \n\nP.S. I hate my life every day.", "title": "How to Parent ADHD/ASD Child", "permalink": "/r/regretfulparents/comments/165gw3y/how_to_parent_adhdasd_child/", "scores": {"Negativo": 0.4653869867324829, "Neutro": 0.5042160153388977, "Positivo": 0.030396977439522743}}
{"id": "1bda855", "thumbnail": "self", "selftext": "asd has up to 40 %, thats huge, is there any other organisation that has this payment?\n\nSkills Payments: Up to 40% loading on base salary may be applicable upon further assessment. Skills Payments count as salary for superannuation, though do not count as salary for the purpose of service allowance.\n", "title": "40% skill payment from asd", "permalink": "/r/AusPublicService/comments/1bda855/40_skill_payment_from_asd/", "scores": {"Negativo": 0.07505520433187485, "Neutro": 0.893872082233429, "Positivo": 0.031072666868567467}}
{"id": "1cymi2a", "thumbnail": "self", "selftext": "Two conditions that can be diagnosed in adulthood but require childhood onset. Both conditions with influx of patients requesting assessment and specific diagnosis, but I believe for very different reasons.\n\nWith ADHD it seems easier to me. Perhaps because there is a indicated gold-standard treatment. Many times these patients are presenting with a focused struggle (i.e. trouble in college) but pan-endorse all symptoms going back until childhood. If you inappropriately diagnose someone with ADHD you may treat them with a medication that will either improve their symptoms or not. If medication doesn't help the patient is more likely to be open to alternative diagnoses or explanations for their struggles (i.e. depression).\n\nWith ASD it seems like a larger disservice to the patient and also those appropriately diagnosed. Young adults are seeing ASD more like an identity. Its validating for many, but also dismisses the idea that there may be countless alternative explanations for their distress. \"I was born this way\" kind of mentality which could prevent a depressed person from considering medication, or a person with BPD from engaging in DBT.\n\nThere is also a strong gut feeling component from the MSE. Someone who is hyperactive and/or inattentive is more apparent vs someone who is repeating clusters of symptoms from a YouTube video that sometimes refer to pretty universal human experiences.\n\nAm I wrong in this? I'm just a resident so thoughts and experiences very welcome.\n\nEdit: for clarity, I'm not saying I'm struggling with differentiating between the two like \"vs\" in the title might suggest.", "title": "Challenges of adult diagnoses, ASD vs ADHD", "permalink": "/r/Psychiatry/comments/1cymi2a/challenges_of_adult_diagnoses_asd_vs_adhd/", "scores": {"Negativo": 0.36940398812294006, "Neutro": 0.5957215428352356, "Positivo": 0.034874532371759415}}
{"id": "17lyir7", "thumbnail": "self", "selftext": "Hi everyone! I am trying to get an ASD diagnosis and that requires me recalling child\nmemories but not sure what information would be important for the diagnosis. Can you guys please share some of the signs that you guys had in childhood? Thank you very much 😊", "title": "Childhood Signs of ASD", "permalink": "/r/aspergirls/comments/17lyir7/childhood_signs_of_asd/", "scores": {"Negativo": 0.6610133647918701, "Neutro": 0.3264302611351013, "Positivo": 0.012556377798318863}}
{"id": "1bpzj6w", "thumbnail": "self", "selftext": "My 4yo son will be starting kindergarten in the fall. He's been diagnosed with ASD Level 1. Very sweet, very intelligent, and often lives in his own world to the point where he doesn't really engage with the other kids in his preschool and instead spends much of his time rolling around in the \"quiet corner.\"\n\nHis mom and I are already working with his soon-to-be elementary school on an IEP. He has an OT he meets with weekly, and plenty of daily structure to orient himself around. I'm not terribly worried about him academically -- he picks things up well, and his ability to focus and pay attention gets better every day.\n\nSocially though, I'm really worried. He loves his friends at preschool, but recently they're picking up on just how different he is and beginning to reject him in all sorts of ways. I can't blame them either. He's often making \"mouth noises,\" has no real concept of personal space, and has a difficult time doing what the group is doing instead of trying to steer things towards his own interests. 30 years ago I would have dismissed him as the \"weird kid\" too...\n\nI want to help, but I'm worried about breaking his confidence. He already has a tendency to say he \"can't do\" things and give up, and I don't want to tell him that his behavior is annoying without giving him some solid actions he can take to fit in a bit better. I also know that it's up to him to change his behavior, that I can't force it, and that he needs to know that his mom and I love him no matter what. My anxiety around his social skills certainly isn't helping either.\n\nAny advice, similar experiences, etc... are really welcome. Thanks for letting me vent a bit\n\n", "title": "Socially annoying ASD-1 behaviors", "permalink": "/r/Parenting/comments/1bpzj6w/socially_annoying_asd1_behaviors/", "scores": {"Negativo": 0.9350203275680542, "Neutro": 0.06055384874343872, "Positivo": 0.004425717052072287}}
{"id": "164s0hy", "thumbnail": "self", "selftext": "We are on fence about getting diagnosis for almost a year now. Our LO is soon turning 4 and she is hypersensitive, has issues with self regulation, mamy traits associated with ADHD (although she is too small to be sure). \n\nKindergarden trachers and specialist in education support have suggested she may have some mild Autism (Asperger's) while behaviorist specialised in training autists and our friend who is child psychiatrist are convinced that she is not.\n\nShould we diagnose her? What if she doesn't have ASD and get diagnosed with it? Will she suffer because other will expect her to have ASD while she don't have it? Will she be stigmatised for the rest of her life? Will her self estrem be undermined?\n\nDo you know anyone who ever regreted getting the diagnosis?", "title": "Did you every regreted diagnosing your child for ASD?", "permalink": "/r/Parenting/comments/164s0hy/did_you_every_regreted_diagnosing_your_child_for/", "scores": {"Negativo": 0.494107186794281, "Neutro": 0.48914650082588196, "Positivo": 0.0167462807148695}}
{"id": "msngxq", "thumbnail": "https://b.thumbs.redditmedia.com/JyntdYA0lxtlAvitfE6P3XL9XhSMDNehvs4e8cnpePY.jpg", "selftext": "", "title": "asd", "permalink": "/r/196/comments/msngxq/asd/", "scores": {"Negativo": 0.26013481616973877, "Neutro": 0.5262386798858643, "Positivo": 0.21362651884555817}}
{"id": "16zxo06", "thumbnail": "https://a.thumbs.redditmedia.com/qYfeZ8XlPSkIlHWaOwuxfg_AQVKj8Tp_fgdADbJ8ET0.jpg", "selftext": "I've never been more proud as a father.", "title": "Something my child said in their ASD assessment", "permalink": "/r/autism/comments/16zxo06/something_my_child_said_in_their_asd_assessment/", "scores": {"Negativo": 0.1754913330078125, "Neutro": 0.7968341112136841, "Positivo": 0.02767455205321312}}
{"id": "or86r7", "thumbnail": "image", "selftext": "", "title": "ASD gives you big titties", "permalink": "/r/badwomensanatomy/comments/or86r7/asd_gives_you_big_titties/", "scores": {"Negativo": 0.2240930050611496, "Neutro": 0.5689882040023804, "Positivo": 0.20691877603530884}}
{"id": "1c6khwk", "thumbnail": "spoiler", "selftext": "", "title": "She went through the five stages of Okey Dokey", "permalink": "/r/Fallout/comments/1c6khwk/she_went_through_the_five_stages_of_okey_dokey/", "scores": {"Negativo": 0.050986405462026596, "Neutro": 0.8923975229263306, "Positivo": 0.05661608651280403}}
{"id": "1az9owo", "thumbnail": "https://b.thumbs.redditmedia.com/Pi5dTeLPlotVBh1GSwGbH2FhHVw5ZbF1Hbvmhkxz9KI.jpg", "selftext": "Okey Dockey (forgot her actual name) and her husband (who looks like Tanner and Derik's brother) are just as weird as the Beestons. Okey Dockey is actually friends with Lo and Tanner. \n\nSome of the things that bothers me about the mom is that she's been breastfeeding her sons for years. Her eldest son is nearly four years old. Just to be clear I'm not against breastfeeding. I just find it weird that this mom is breastfeeding her sons even though they should have been weaned a long time ago.\nAlso the parents are either taking their kids on long trips or leaving them with a nanny to go on long trips by themselves.  The mom has also gotten some sponsorships that feature her boys. The mom is also a beige mom, everything in her house is beige.\nAnother thing I've noticed is that they constantly make videos where one of them walks into the bedroom or living room to find either mom or dad asleep with the boys (like falling asleep while reading a bedtime story). It was cute at first but now it's too often to be genuine, most likely being staged.", "title": "Has anyone ever seen Okey Dockey?", "permalink": "/r/beestonfamilysnark/comments/1az9owo/has_anyone_ever_seen_okey_dockey/", "scores": {"Negativo": 0.10066941380500793, "Neutro": 0.8662543892860413, "Positivo": 0.03307630866765976}}
{"id": "1ca5w9k", "thumbnail": "self", "selftext": "The title says it all; I'm genuinely curious how most of y'all spell it! ", "title": "Is it \"okey dokey\" or \"okie dokie\"?", "permalink": "/r/Fallout/comments/1ca5w9k/is_it_okey_dokey_or_okie_dokie/", "scores": {"Negativo": 0.10902831703424454, "Neutro": 0.8392929434776306, "Positivo": 0.051678720861673355}}
{"id": "1c4jg5w", "thumbnail": "image", "selftext": "Hi gents, I was just wondering what your thoughts are on AskOkey's advice about suiting. Where would one need to look for similar levels of detail and attention in Australia (preferably SA)", "title": "Thoughts on AskOkey?? Skinny vs Full Cut Trousers", "permalink": "/r/AustralianMFA/comments/1c4jg5w/thoughts_on_askokey_skinny_vs_full_cut_trousers/", "scores": {"Negativo": 0.061110492795705795, "Neutro": 0.8953351378440857, "Positivo": 0.043554384261369705}}
{"id": "1c5ykrq", "thumbnail": "https://b.thumbs.redditmedia.com/hJM6JyB4cDue6rp7gQPpJTqtQbG4d_5HQWQVXORS59Q.jpg", "selftext": "", "title": "Lucy from the Fallout Show saying Okey Dokey but with different faces and reactions", "permalink": "/r/MemeTemplatesOfficial/comments/1c5ykrq/lucy_from_the_fallout_show_saying_okey_dokey_but/", "scores": {"Negativo": 0.0678807720541954, "Neutro": 0.8633022904396057, "Positivo": 0.0688169077038765}}
{"id": "cebaz6", "thumbnail": "https://a.thumbs.redditmedia.com/jecqp-XUFGza2MMX1HQ7ttT7i1xbyrjc3um9wjDxpA0.jpg", "selftext": "", "title": "8 gün sonra festivale gidicem hangisini alayım durex mi daha kolay takılır okey mi? Bide erken sıkıntısı var o yüzden rötar düşünüyorum", "permalink": "/r/KGBTR/comments/cebaz6/8_gün_sonra_festivale_gidicem_hangisini_alayım/", "scores": {"Negativo": 0.23887518048286438, "Neutro": 0.7106695175170898, "Positivo": 0.050455350428819656}}
{"id": "1ah5teo", "thumbnail": "https://b.thumbs.redditmedia.com/jwEwiysWIXavbtABaMGQP2o79Nzek74bFlsI5AoqFgk.jpg", "selftext": "This write up will summarize everything I’ve learned through trial an error on my journey to pleated perfection.\n\nWho are they for? Everyone. They look good on anyone. Short, tall, rotund, petite. They work because they follow science based rules in their design. Pants are already versatile, unisex, and cover about 2/3s of the body without much thought. Pleats bring a visual and practical enhancement no other pant provides. \n\nWhy Pleated? \n\nComfort. Practicality. Aesthetics.\nPleated pants get a bad rap but they are one of the comfiest and stylish articles of clothing. \n\nComfort: Pleats are made by gathering extra material which are folded and tucked into the waistband of trousers. When the wearer makes movements such as sitting, kneeling, squatting or walking, this extra fabric gives to these movements and returns to its closed position when standing or resting upright. Pleats keep the fabric away from the wearers body maximizing airflow.\n\nPracticality: Pleats allow the wearer to make use of the trouser’s pockets without unsightly bulges/pulling typical of their flat-front counter parts. Therefore, it reduces wear, friction, or stress on the seams and fabric resulting in a longer lifespan of the trousers. \n\nAesthetics: Pleats offer a distinct look no other pant can. It provides several focal points for the eyes to latch on to and imbues every outfit with the rule of thirds effortlessly. \n\nThe darting in the front makes the eyes travel vertically down the crease of the pants revealing a cuff resting on the wearer’s tastefully picked footwear. The reverse happens when the mid-high waist of the pleated waistband draws the eyes up to the belt line, top garments, and accessories . The eyes aren’t struggling by viewing breaks in the wearer’s figure the pleats have grounded them as a single column of curated intricacies.\n\nTHE SCIENCE OF PLEATS\n\nThis section will guide you on how to buy, thrift, or sew the pleated pant. It can be personalized but some guidelines are there to keep what makes the pleat great. It’s Drape. It all boils down to the drape. Everything else can be personalized to you but The Drape is non negotiable.\n\nWAIST\n\nIt should be mid to high rise. Waistband needs to either sit above, on, or slightly below your belly button; your natural waist line. Take a measurement of your crotch.  When shopping use this to find trousers that corresponds with your crotch measurements when you tally its front and back rise respectively.\n\n*avoid* Low rise. Big fat NO. Low rise will give you child birthing hips, and make you look dumpy. You’ll no longer benefit from the drape or the rule of thirds it provides. \n\nLEGS \n\nFull cut legs. Wide legs. Straight legs. Relaxed legs. This is one of the elements that give the pleated trouser its signature drape. It keeps the fabric away from your body, reduces unsightly creases, and gives that not trying too hard unassuming cool it’s known for. \n\nYou can opt for full length with your choice of trouser break and cropped variations. \n\n*avoid* carrot fit legs (trendy, these age terribly), slim legs, or skinny legs. Why even pleat? Just go flat-front. \n\nCUFFS \n\nYour cuffs can vary anywhere between 1” to 2”. Play with this until you find what works for your frame. Cuffs keep the pant crease straight and uniform when lined up with the main pleat when ironed, and makes the bottom of the pant leg heavy so your pleats remain closed while standing/resting. When in stride the cuffs keep the legs straight, balanced, and visually smooth.\n\nLEG OPENING \n\n I need to repeat this again. YOU NEED A CUFF! not only for the reasons mentioned above, that is unless you want your pants leg pooling around the shoe or dragging as seen today’s modern styling. Then please ignore. \n\nThat said, your leg opening needs to cover  at-least 2/3 of your shoe. This will keep your trousers straight and give that lovely pant-shoe interaction. \n\ne.x i wear a size 15. My leg openings are usually 22-24”. I’m 6’4” and my pleated trousers fall straight and break over my shoes while looking proportional to my frame. If i want a slightly tapered look, i opt for 20” leg opening still meeting the 2/3 rule according to my shoe size. \n\nTUCKS \n\nYour personal preference comes in here, but here’s some of what usually works.\n\n1 tuck - good for slim, slim-tall, small, petite, shorter frames. It doesn’t add excessive bulk. It provides the comfort and drape while keeping your figure streamlined. The most natural for people of this body type. \n\n2 tucks - athletic, big or tall, spherical frames. This number of tucks for this group of people gives a slimming effect while providing ample room in the thigh/glutes due to the extra fold. Simply put, they can fill this out more and it’ll remain proportionate to their larger frames. Smaller frames can partake but need to play with rise, fabric type/weight and etc. to minimize the bulk. This is the most popular and visually striking tuck for pleated pants.\n\n3 tucks - Vary rare in traditional menswear and no one would need this many tucks unless built like you’re “only as good as your last envelope” Tony Soprano. I have seen this mostly done by brands (Margiela, Bottega, Valentino) looking to exaggerate the flow or bagginess of their garment.\n\nEXTRAS\n\nBuckle backs, side adjusters, elasticated waistbands, etc. Do it up to your hearts content. Just keep to the guidelines above and you’ll have a trouser that will keep serving you.\n\nWHO MAKES THEM?\n\n- Casatlantic \n- MFPEN\n- Scott Frazier \n- Buzz Rickson (other Japanese repro)\n- Albus Lumen\n- Ralph Lauren (Andrew Fit ebay)", "title": "The Definitive Guide on Pleats", "permalink": "/r/ThrowingFits/comments/1ah5teo/the_definitive_guide_on_pleats/", "scores": {"Negativo": 0.04291503503918648, "Neutro": 0.8711645603179932, "Positivo": 0.08592044562101364}}
{"id": "1dcfc88", "thumbnail": "https://external-preview.redd.it/bGRhcnZqZjl6bzVkMb12d3ex4l35Vw6BJS8OvbwUTpFnMOdKjWM6avs7aOX3.png?width=140&amp;height=140&amp;crop=140:140,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=afa01265f622c99383c811d00421ba01c65bc763", "selftext": "", "title": "Okey dokey 🇨🇦💪🪵🪓🫡", "permalink": "/r/justgalsbeingchicks/comments/1dcfc88/okey_dokey/", "scores": {"Negativo": 0.03202103450894356, "Neutro": 0.5950018763542175, "Positivo": 0.3729771077632904}}
{"id": "wqu9zd", "thumbnail": "https://a.thumbs.redditmedia.com/co90OjRHDYEVeGLDag1PH6xV3qZ8JtxkVX6QbNY6Uk4.jpg", "selftext": "", "title": "Okey-dokey", "permalink": "/r/insaneparents/comments/wqu9zd/okeydokey/", "scores": {"Negativo": 0.14883722364902496, "Neutro": 0.6107663512229919, "Positivo": 0.2403964102268219}}
{"id": "15gh69r", "thumbnail": "https://external-preview.redd.it/dXBkNmRuaDR0cWZiMWJ0LFCB6MHJOHCM1Fm6h0mCR9F3VGUOqGPDoIV2VWSM.png?width=140&amp;height=140&amp;crop=140:140,smart&amp;format=jpg&amp;v=enabled&amp;lthumb=true&amp;s=23a6c7c8003fc5887fa68a4ce9e22238e8cd560c", "selftext": "", "title": "Okey ", "permalink": "/r/CringePurgatory/comments/15gh69r/okey/", "scores": {"Negativo": 0.18453964591026306, "Neutro": 0.6450033783912659, "Positivo": 0.17045703530311584}}
{"id": "17qqcxt", "thumbnail": "https://b.thumbs.redditmedia.com/XZODh5_1axkRzpBx32CRgf8yReSXnHJ83ZBSLqPzCxM.jpg", "selftext": "", "title": "LETZ GO LOOTIN BOYZ!", "permalink": "/r/orks/comments/17qqcxt/letz_go_lootin_boyz/", "scores": {"Negativo": 0.010504004545509815, "Neutro": 0.2379637509584427, "Positivo": 0.7515323162078857}}
{"id": "pz77p8", "thumbnail": "https://b.thumbs.redditmedia.com/b9LsTuOQIOXtC2AbStemDl6N3k4QhJ-bmtThdQ03rzY.jpg", "selftext": "", "title": "GUYS, I BOUGHT THAT GAME Y'ALL TALKING ABOUT, LETZ GO FUCK UP SAVATHŮN", "permalink": "/r/destiny2/comments/pz77p8/guys_i_bought_that_game_yall_talking_about_letz/", "scores": {"Negativo": 0.7288644909858704, "Neutro": 0.2160988301038742, "Positivo": 0.05503666400909424}}
{"id": "17y4oqa", "thumbnail": "self", "selftext": "Heading towards the holy dome. 5 hour ride incoming. How long will it take for you to get there?\n\nHave a safe trip ppl and see you tonight!🫶🏻", "title": "LETZ GO TO QLIMAX BABY", "permalink": "/r/hardstyle/comments/17y4oqa/letz_go_to_qlimax_baby/", "scores": {"Negativo": 0.006286276038736105, "Neutro": 0.3405540883541107, "Positivo": 0.6531596183776855}}
{"id": "17lhtcz", "thumbnail": "https://b.thumbs.redditmedia.com/ZiSfcTRt158HyMjFERf2IQMRFubPbuJNj1A2goEEM3Y.jpg", "selftext": "I’m on the final three lap fours can I get some advice for war?", "title": "AYO LETZ GO", "permalink": "/r/PizzaTower/comments/17lhtcz/ayo_letz_go/", "scores": {"Negativo": 0.03228050470352173, "Neutro": 0.4821477234363556, "Positivo": 0.4855717718601227}}
{"id": "1cqvhll", "thumbnail": "self", "selftext": "Buttert alle noch rein habe auch noch mal 1,8mio Anteile gekauft", "title": "Letz Go ", "permalink": "/r/Europlasma/comments/1cqvhll/letz_go/", "scores": {"Negativo": 0.03418706730008125, "Neutro": 0.5499362945556641, "Positivo": 0.4158766269683838}}
{"id": "jtoxya", "thumbnail": "https://b.thumbs.redditmedia.com/O5VeuoRbmkuRvhxUxN5lfrLgP61iw3MRvYC8fjv9Rpo.jpg", "selftext": "", "title": "LETZ GO!!!!", "permalink": "/r/ThickFit/comments/jtoxya/letz_go/", "scores": {"Negativo": 0.015032670460641384, "Neutro": 0.18340493738651276, "Positivo": 0.8015623688697815}}
{"id": "1cr32mr", "thumbnail": "https://b.thumbs.redditmedia.com/ItR4cxomeTlJ4D0Rn0hAsCPYMtJ_88JKs75GnK8y3-k.jpg", "selftext": "🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀 0,5€ letz Go ", "title": "Europlasma letz Go", "permalink": "/r/AMCEntertainmentStock/comments/1cr32mr/europlasma_letz_go/", "scores": {"Negativo": 0.024015089496970177, "Neutro": 0.7519712448120117, "Positivo": 0.22401368618011475}}
{"id": "z9qye3", "thumbnail": "https://b.thumbs.redditmedia.com/MRgJDXsCfoG7HVk8xXvme_R-0F-e8Vej2U-TenanevM.jpg", "selftext": "", "title": "letz go boyz", "permalink": "/r/orks/comments/z9qye3/letz_go_boyz/", "scores": {"Negativo": 0.012069807387888432, "Neutro": 0.35044488310813904, "Positivo": 0.6374853253364563}}
{"id": "ozwbhf", "thumbnail": "https://b.thumbs.redditmedia.com/_4IkRiq8iHsIKFuXWSwG6_uC_2PZINDGpCL-G7mrqto.jpg", "selftext": "", "title": "Let'z go", "permalink": "/r/ZargoryanGalaksisi/comments/ozwbhf/letz_go/", "scores": {"Negativo": 0.07140423357486725, "Neutro": 0.5340079069137573, "Positivo": 0.39458784461021423}}
{"id": "182azpt", "thumbnail": "https://b.thumbs.redditmedia.com/cxIb2pDWaOQKOcOgJRyQEKcV810OoiQqZ687D_snMCA.jpg", "selftext": "", "title": "Letz go", "permalink": "/r/shitposting/comments/182azpt/letz_go/", "scores": {"Negativo": 0.04846743866801262, "Neutro": 0.5871667861938477, "Positivo": 0.36436572670936584}}
